<?
//----------------------------------------------------------------------------------
// DataBase
//----------------------------------------------------------------------------------
$MASTERHOST = "127.0.0.1";
$MASTERUSER = "root";
$MASTERPASSWD = "";
$MASTERDBNAME = "task";

//----------------------------------------------------------------------------------
// TaskMaster
//----------------------------------------------------------------------------------
$sqldef["taskmaster"] =
	"SELECT taskid AS rowid, taskmaster.* FROM taskmaster"
	. "[searchsql]"
	. " ORDER BY mod_date DESC";

$select["category"] =
	array( 0 => "未定", 1 => "ユーザ(モバイル)", 2 => "ユーザ(PC)", 3 => "クライアント" );

$select["priority"] =
	array( 0 => "未定", 10 => "至急", 20 => "Ａ", 30 => "Ｂ", 40 => "Ｃ" );

$select["status"] =
	array( 0 => "未定", 10 => "仕様検討中", 20 => "開発中", 30 => "検証中", 40 => "完了",
		   50 => "平間待ち", 60 => "鈴木待ち", 70 => "渡邊待ち" );

?>
